benchmarks/products-1-replica.log
Running 30s test @ http://localhost/products
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    56.76ms   12.59ms 123.43ms   70.51%
    Req/Sec   441.94     68.54   600.00     68.75%
  52837 requests in 30.04s, 74.48MB read
Requests/sec:   1758.85
Transfer/sec:      2.48MB